GIT - распределенная система контроля версий
Это система для отслеживания и ведения истории изменений ваших файлов или проекта.

Репозиторий - хранилище ваших файлов, которые вы отслеживаете при помощи гита , и их изменений.

Команда Git: 
1. git init - она создает новый гит репозиторий локально на нвшем ПК , создаст она в той директории где вы запускаете эту команду.

2. git add - когда мы создаем и изменяем файлы то при помощи этой команды мы загружаем все изменения в промежуточное место хранение

git add <file_name>
git add . -> все в текущей директории

3. git commit - как только мы достигаем определенного момента разработки то мы тогда сохраняем и коментируем все наши изменения в репозиторий. 
(фиксация изменений в репо.)

git commit -m '<comment>'

.


